#файл с текстами для сообщений

start_message = 'Привет, я бот, который поможет тебе устроиться на работу или найти человека, соответствующего вашей.'

menu = 'Выбери что ты хочешь сделать'

enter_name_vacancy = 'Введи название вакансии'

enter_specialization = 'Введи специализацию для вакансии'

enter_description = 'Введи описание вакансии'

enter_key_skills = 'Введи ключевые навыки через точку с запятой'

enter_income = 'Введите уровень дохода в месяц'

here_is_your_vacancy = '''Вот ваша вакансия, все верно?
Название: {}
Специализация: {}
Описание: {}
Ключевые навыки: {}
Доход: {}'''

vacancy_created = '''Отлично, вакансия создана!
Что теперь?'''

find_vacancies = 'Введи название вакансии, которую хочешь найти'

what_we_found = 'Вот что я нашел для тебя по этому запросу:'

vacancy_template = '''Название: {}
Специализация: {}
Описание: {}
Ключевые навыки: {}
Доход: {}'''

vacancy_template_with_deeplink = '''Название: {}
Специализация: {}
Описание: {}
Ключевые навыки: {}
Доход: {}

Ссылка на вакансию - {}'''

send_me_your_resume = 'Отправь мне свое резюме с hh.ru в формате PDF. Я сравню его с требованиями к вакансии и сообщу тебе ответ.'

something_wrong = 'Что-то пошло не так, кажется, ты отправил файл неверного формата, попробуй еще раз или вернись обратно'

resume_in_treatment = 'Резюме обрабатывается, возможно, придется немного подождать.'

resume_is_good = 'Отлично, резюме одобрено!'

resume_is_bad = 'Сожалеем, но резюме не подходит под эту вакансию'

placed_vacancies = 'Вот список размещенных вами вакансий:'

send_me_task = 'Отправь мне файл с тестовым заданием, которое будет отправлено соискателю'

saved_task = 'Отлично, я сохранил тестовое задание и буду его отсылать подходящим специалистам.'

here_is_task = 'Вот тестовое задание, оставленное работодателем. Чтобы прикрепить решение, выйди в главное меню.'

there_is_no_task = 'Работодатель не оставил тестового задания. Мы передали твои контакты работодателю и он свяжется с тобой, если сочтет твою кандидатуру достойной.'

send_me_solution = 'Отправь мне решение тестового задания'

test_task_solution_sent = 'Отлично, отправили твое решение работодателю. Жди ответа'

user_made_task = '@{} выполнил тестовое задание на вакансию {}. Вот его решение'

user_without_task = 'Резюме @{} подходит под вакансию {}. Можете с ним связаться'

additional_information = '''Созидательная среда и интересные проекты;
Активные, неравнодушные, ответственные за свой результат коллеги;
Конкурентная заработная плата и система премирования;
Один из лучших на рынке социальных пакетов:
🔵 медицинская страховка с первого дня работы,
🔵 отпуск 33 календарных дня,
🔵 материальная помощь и дополнительные выплаты,
🔵 дисконтные и корпоративные программы компаний-партнеров;
Насыщенная корпоративная жизнь и обширные возможности для всестороннего развития;
Современные и удобные офисы в пешей доступности от метро.
'''

deleted_vacancy = 'Вакансия удалена'

set_username = 'Пожалуйста, укажи username в настройках своего аккаунта, иначе работодатель не сможет с тобой связаться'

username_set = 'Отлично, теперь нажми на {}'

